//Розробка функції, яка перевіряє, чи текстовий рядок є “приблизно правильною” електронною адресою
function checkEmail(str) {
    if(!str.length)
    alert("Incorrect e-mail!");
    /* Якщо рядок пустий, то він не є електронною адресою */
    
    var re = new RegExp("[a-zA-Z_.]+@{1}[a-zA-Z_.]+[\.]{1}[a-zA-Z_]+");
    
    str = str.replace(re, "");
    // замінимо знайдений перший екземпляр шаблону пустим рядком
    if(!str.length)
    /* якщо після заміни в рядку не лишиться символів, то записана
    коректна адреса, про що ми і повідомимо: */
    alert('OK');
    else
    // інакше адреса неправильна
    alert("Incorrect e-mail!");
}